Repository: Juaniscarlos23jurez/finanza
Catalog: lib/l10n/app_*.arb
Languages: es, it, ja, zh

# howMuchToAssign
source: How much will you assign to your expenses?
es: ¿Cuánto asignarás a tus gastos?
it: Quanto assegnerai alle tue spese?
zh: 您将为支出分配多少？

# budgetLimitInfo
source: This will be your monthly limit for expenses outside of your debts.
es: Este será tu límite mensual para gastos fuera de tus deudas.
it: Questo sarà il tuo limite mensule per le spese al di fuori dei tuoi debiti.
zh: 这将是您除债务外的每月支出限额。

# stepSaleTitle
source: 2. First Sale
es: 2. Primera Venta

# stepSaleSubtitle
source: Record your first sale or income of the day.
es: Registra tu primera venta o ingreso del día.

# stepSaleHint
source: e.g. Product sale
es: Ej. Venta de producto

# stepSourcesTitle
source: 1. Money Sources
es: 1. Fuentes de Dinero
it: 1. Fonti di denaro
zh: 1. 资金来源

# stepSourcesSubtitle
source: Add your regular income sources.
es: Agrega tus fuentes de ingresos regulares.
it: Aggiungi le tue fonti di reddito regolari.
zh: 添加您的定期收入来源。

source: Add Source
es: Agregar Fuente

source: Source name
es: Nombre de la fuente

# sourceNameHint
source: Salary, Freelance, etc.
es: Sueldo, Freelance, etc.

# sourceAmount
source: Amount
es: Monto

# sourceFrequency
source: Frequency
es: Frecuencia

# frequencyWeekly
source: Weekly
es: Semanal

# frequencyMonthly
source: Monthly
es: Mensual

source: Finish
es: Finalizar

source: Next
es: Siguiente

source: Back
es: Atrás

# onboardingComplete
source: Setup completed!
es: ¡Configuración completada!

# budgetRequired
source: Please enter a valid budget
es: Por favor ingresa un presupuesto válido

# saleRequired
source: Please record your first sale
es: Por favor registra tu primera venta

# sourcesRequired
source: Please add at least one income source
es: Por favor agrega al menos una fuente de ingresos

# stepDebtTitle
source: 2. Your Debts
es: 2. Tus Deudas
it: 2. I tuoi debiti
zh: 2. 您的债务

# stepDebtSubtitle
source: Record your current debts to help us plan.
es: Registra tus deudas actuales para ayudarte a planear.
it: Registra i tuoi debiti attuali per aiutarci a pianificare.
zh: 记录您目前的债务，以帮助我们进行计划。

# debtsRequired
source: Please add at least one debt or enter 0 if you have none.
es: Por favor agrega al menos una deuda o ingresa 0 si no tienes.
it: Per favore aggiungi almeno un debito o inserisci 0 se non ne hai.
zh: 请至少添加一项债务，如果没有请填0。

source: Add Debt
es: Agregar Deuda

source: Debt name
es: Nombre de la deuda

# debtNameHint
source: Credit card, Loan, etc.
es: Tarjeta de crédito, Préstamo, etc.

# debtAmount
source: Total amount
es: Monto total

# debtInterest
source: Interest (%)
es: Interés (%)

# debtDueDate
source: Due date
es: Fecha de pago

# stepGoalTitle
source: 4. Your Goals
es: 4. Tus Metas
it: 4. I tuoi obiettivi
zh: 4. 您的目标

# stepGoalSubtitle
source: What are you saving for?
es: ¿Para qué estás ahorrando?
it: Per cosa stai risparmiando?
zh: 您为什么而存钱？

source: Add Goal
es: Agregar Meta

source: Goal name
es: Nombre de la meta

# goalNameHintOnboarding
source: Trip, Car, Emergencies...
es: Viaje, Carro, Emergencias...

# goalTarget
source: Target amount
es: Monto objetivo

# onboardingSummary
source: Financial Summary
es: Resumen Financiero
it: Riepilogo finanziario
zh: 财务摘要

# onboardingSummarySubtitle
source: This is how your configured finances look.
es: Así se ven tus finanzas configuradas.
it: Ecco come appaiono le tue finanze configurate.
zh: 这是您配置好的财务状况。

source: Estimated Monthly Balance
es: Balance Mensual Estimado

source: Total Debts
es: Deudas Totales

# totalGoals
source: Budget for Goals
es: Presupuesto para Metas

source: My Budget
es: Mi Presupuesto

source: Budget Used
es: Presupuesto Usado

# remainingBudget
source: Remaining
es: Restante

# debtsTitle
source: My Debts
es: Mis Deudas

# chartBudget
source: Budget
es: Presupuesto

# chartSavings
source: Savings
es: Ahorros

# chartDebt
source: Debt
es: Deuda

# onboardingSummaryExplanation
source: This summary shows the relationship between your income, budgeted monthly expenses, and debts. The 'Monthly Balance' is the free money you have each month to save or invest.
es: Este resumen muestra la relación entre tus ingresos, gastos mensuales presupuestados y deudas. El 'Balance Mensual' es el dinero disponible que tienes cada mes para ahorrar o invertir.

source: Total Monthly Income
es: Ingreso Mensual Total
it: Reddito mensile totale
zh: 每月总收入

source: Monthly Budget Limit
es: Límite de Presupuesto
it: Limite budget mensile
zh: 每月预算限额

# savingCapacityFormula
source: Income ({income}) - Expenses ({budget}) = {balance} free for goals and emergencies.
es: Ingreso ({income}) - Gastos ({budget}) = {balance} libres para metas y emergencias.

# savingCapacityTitle
source: Your monthly saving capacity
es: Tu capacidad de ahorro mensual

# debtPayment
source: Monthly payment
es: Pago mensual

# debtPaymentSummary
source: {interest}% - Payments: {amount}
es: {interest}% - Pagos: {amount}
it: {interest}% - Pagamenti: {amount}
zh: {interest}% - 支付：{amount}

# debtPaymentHint
source: e.g. 500
es: Ej. 500

source: Monthly Debt Commitment
es: Compromiso Mensual de Deuda

source: Real Saving Capacity
es: Capacidad de Ahorro Real
it: Capacità di risparmio reale
zh: 实际储蓄能力

# advisorContext
source: As your financial advisor, I suggest...
es: Como tu asesor financiero, te sugiero...
it: Come tuo consulente finanziario, ti suggerisco...
zh: 作为您的财务顾问，我建议...

# financialHealthGood
source: Your financial health looks solid. You have a positive surplus for your goals.
es: Tu salud financiera se ve sólida. Tienes un excedente positivo para tus metas.
it: La tua salute finanziaria sembra solida. Hai un surplus positivo per i tuoi obiettivi.
zh: 您的财务状况看起来稳健。您有足够的余力实现目标。

# financialHealthWarning
source: Attention: Your monthly commitments exceed your income. You need to adjust your budget.
es: Atención: Tus compromisos mensuales superan tus ingresos. Necesitas ajustar tu presupuesto.
it: Attenzione: i tuoi impegni mensili superano il tuo reddito. Devi aggiustare il tuo budget.
zh: 注意：您的每月支出超过了收入。您需要调整预算。

source: Net Cash Flow
es: Flujo de Caja Neto

# savingCapacityFormulaRefined
source: Income ({income}) - Expenses ({budget}) - Debt Payments ({debt}) = {balance} free.
es: Ingresos ({income}) - Gastos ({budget}) - Pagos Deuda ({debt}) = {balance} libres.
it: Reddito ({income}) - Spese ({budget}) - Pagamenti debito ({debt}) = {balance} liberi.
zh: 收入 ({income}) - 支出 ({budget}) - 债务偿还 ({debt}) = 剩余 {balance}。

source: Skip
es: Saltar

# skipOnboardingTitle
source: Skip Setup?
es: ¿Saltar configuración?

# skipOnboardingMessage
source: If you have already configured your profile before, you can skip this step. Otherwise, we recommend completing it so the AI can give you better advice.
es: Si ya configuraste tu perfil anteriormente, puedes saltar este paso. De lo contrario, te recomendamos completarlo para que la IA pueda darte mejores consejos.

# monthlyBudgetLabel
source: Monthly Budget
es: Presupuesto Mensual

# addDebtTitle
source: New Debt
es: Nueva Deuda

# debtMonthlyPayment
source: Monthly Payment
es: Pago Mensual

source: Save Changes
es: Guardar Cambios

# noBudgetSet
source: You haven't set a budget yet
es: Aún no tienes un presupuesto configurado

# noDebtsSet
source: No debts registered
es: No has registrado deudas

source: Set Up Budget
es: Configurar Presupuesto

# setupDebts
source: Register Debts
es: Registrar Deudas

# messageTooLong
source: Message is too long. Maximum {maxLength} characters.
es: El mensaje es demasiado largo. Máximo {maxLength} caracteres.

# aiErrorMessage
source: The AI response came with an incorrect format. Please try asking again.
es: La respuesta de la IA llegó con un formato incorrecto. Por favor intenta preguntar de nuevo.

source: Update Available
es: Actualización disponible

source: Mandatory Update
es: Actualización obligatoria

# updateMessageOptional
source: A new version ({version}) is available. Do you want to update?
es: Hay una nueva versión disponible ({version}). ¿Deseas actualizar ahora?

# updateMessageMandatory
source: You cannot continue using the app with this version. Please update to version {version}.
es: No puedes continuar utilizando la aplicación con esta versión. Debes actualizar a la versión {version}.

source: Later
es: Más tarde

source: Update
es: Actualizar

# aiConsentTitle
source: AI Usage
es: Uso de inteligencia artificial

# aiConsentDisclosure
source: This app sends the content you type to a third-party AI service (Google Gemini) to generate responses. The data sent may include text you enter in the app. Google processes this data according to its privacy policy. Do you agree to your data being sent to this service?
es: Esta app envía el contenido que escribes a un servicio de inteligencia artificial de terceros (Google Gemini) para generar respuestas. Los datos enviados pueden incluir texto que ingreses en la app. Google procesa estos datos de acuerdo con su política de privacidad. ¿Aceptas que tus datos sean enviados a este servicio?

# aiConsentDeclineConfirmTitle
source: Are you sure?
es: ¿Estás seguro?

# aiConsentDeclineConfirmBody
source: By declining, you won't be able to use AI features to record expenses via voice or text, nor receive personalized advice.
es: Al rechazar, no podrás usar las funciones de inteligencia artificial para registrar gastos con voz o texto, ni recibir consejos personalizados.

# aiConsentDeclineConfirmProceed
source: Continue without AI
es: Continuar sin IA

# aiConsentDeclineConfirmStay
source: Go Back
es: Volver

# manualEntryTitle
source: Manual Entry
es: Registro Manual

# manualEntrySubtitle
source: AI is disabled. Record your movements manually.
es: La IA está desactivada. Registra tus movimientos manualmente.

source: Income
es: Ingreso

source: Expense
es: Gasto

source: Category
es: Categoría

# reEnableAi
source: Enable AI Features
es: Activar Inteligencia Artificial

source: Feedback
ja: フィードバック
zh: 反馈

# typeError
source: Error
it: Errore
ja: エラー
zh: 错误

source: General
it: Generale
ja: 一般
zh: 常规

source: Total
it: Totale
zh: 总计
