Repository: Juaniscarlos23jurez/finanza
Catalog: lib/l10n/app_*.arb
Languages: es, it, ja, zh

# accountSection
source: ACCOUNT
es: CUENTA
ja: アカウント
zh: 账户

# personalInfo
source: Personal Information
es: Información Personal
it: Informazioni Personali
ja: 個人情報
zh: 个人信息

source: Schedule Report
es: Programar Envío de Reporte
it: Programma Rapporto
ja: レポートのスケジュール
zh: 安排报告

# otherSection
source: OTHER
es: OTRO
it: ALTRO
ja: その他
zh: 其他

# termsConditions
source: Terms and Conditions
es: Términos y Condiciones
it: Termini e Condizioni
ja: 利用規約
zh: 条款和条件

source: Privacy Policy
es: Política de Privacidad
it: Informativa sulla Privacy
ja: プライバシーポリシー
zh: 隐私政策

source: Log Out
es: Cerrar Sesión
it: Disconnettersi
ja: ログアウト
zh: 退出登录

# deleteAccount
source: Delete my account permanently
es: Eliminar mi cuenta permanentemente
it: Elimina il mio account in modo permanente
ja: アカウントを完全に削除する
zh: 永久删除我的账户

# deleteAccountTitle
source: Delete account?
es: ¿Eliminar cuenta?
it: Eliminare l'account?
ja: アカウントを削除しますか？
zh: 删除账户？

# deleteAccountContent
source: This action will close your current session.
es: Esta acción cerrará tu sesión actual.
it: Questa azione terminerà la tua sessione corrente.
ja: この操作を行うと、現在のセッションが終了します。
zh: 此操作将结束您当前的会话。

source: Cancel
es: Cancelar
it: Annulla
ja: キャンセル
zh: 取消

source: Confirm
es: Confirmar
it: Conferma
ja: 確認
zh: 确认

# feedbackTitle
source: Give us your Feedback
es: Danos tu Feedback
it: Dacci il tuo Feedback
ja: フィードバックを送る
zh: 给我们反馈

# feedbackSubtitle
source: Your opinion helps us improve the experience for everyone.
es: Tu opinión nos ayuda a mejorar la experiencia para todos.
it: La tua opinione ci aiuta a migliorare l'esperienza per tutti.
ja: あなたの意見は、すべての人のための体験を向上させるのに役立ちます。
zh: 您的意见有助于我们改善所有人的体验。

# feedbackTypeQuestion
source: What is your comment about?
es: ¿De qué trata tu comentario?
it: Di cosa tratta il tuo commento?
ja: コメントの内容は何ですか？
zh: 您的评论关于什么？

# typeSuggestion
source: Suggestion
es: Sugerencia
it: Suggerimento
ja: 提案
zh: 建议

# typeCompliment
source: Compliment
es: Felicitación
it: Complimento
ja: 称賛
zh: 赞扬

# feedbackHint
source: Tell us what you like or what we can improve...
es: Cuéntanos qué te gusta o qué podemos mejorar...
it: Dicci cosa ti piace o cosa possiamo migliorare...
ja: 気に入った点や改善できる点を教えてください...
zh: 告诉我们您喜欢什么或我们可以改进什么...

# sendFeedback
source: Send Comments
es: Enviar Comentarios
it: Invia Commenti
ja: 送信
zh: 发送评论

# feedbackSuccess
source: Thanks for your feedback!
es: ¡Gracias por tu feedback!
it: Grazie per il tuo feedback!
ja: フィードバックありがとうございます！
zh: 感谢您的反馈！

source: Full Name
es: Nombre Completo
it: Nome Completo
ja: 氏名
zh: 全名

source: Email
es: Correo Electrónico
ja: メールアドレス
zh: 电子邮件

source: User ID
es: ID de Usuario
it: ID Utente
ja: ユーザーID
zh: 用户ID

source: Close
es: Cerrar
it: Chiudi
ja: 閉じる
zh: 关闭

# scheduleReportTitle
source: Schedule Report
es: Programar Reporte
it: Programma Rapporto
ja: レポートのスケジュール
zh: 安排报告

# reportDescription
source: You will receive an Excel file with your transactions and an AI-generated financial analysis.
es: Recibirás un Excel con tus movimientos y un análisis financiero generado por IA.
it: Riceverai un file Excel con le tue transazioni e un'analisi finanziaria generata dall'IA.
ja: 取引履歴とAI生成の財務分析を含むExcelファイルを受け取ります。
zh: 您将收到包含您的交易和AI生成的财务分析的Excel文件。

source: Send report to:
es: Enviar reporte a:
it: Invia rapporto a:
ja: レポートの送信先:
zh: 发送报告至：

# frequencyQuestion
source: Every how many days?
es: ¿Cada cuántos días?
it: Ogni quanti giorni?
ja: 何日ごとの送信ですか？
zh: 每多少天？

# daysLoop
source: {count} days
es: {count} días
it: {count} giorni
ja: {count} 日
zh: {count} 天

source: Confirm and Schedule
es: Confirmar y Programar
it: Conferma e Programma
ja: 確認してスケジュール
zh: 确认并安排

# configSaved
source: Configuration saved successfully!
es: ¡Configuración guardada con éxito!
it: Configurazione salvata con successo!
ja: 設定が正常に保存されました！
zh: 配置已成功保存！

source: Language
es: Idioma
it: Lingua
ja: 言語
zh: 语言

# fillAllFields
source: Please fill all fields
es: Por favor llena todos los campos
it: Si prega di compilare tutti i campi
ja: すべての項目を入力してください
zh: 请填写所有必填项

# googleError
source: Google Error: {error}
es: Error con Google:
it: Errore Google: {error}
ja: Googleエラー: {error}
zh: Google错误: {error}

# appleError
source: Apple Error: {error}
es: Error con Apple:
it: Errore Apple: {error}
ja: Appleエラー: {error}
zh: Apple错误: {error}

source: Welcome back.
es: Bienvenido de nuevo.
it: Bentornato.
ja: おかえり なさい。
zh: 欢迎 回来。

source: Password
es: Contraseña
ja: パスワード
zh: 密码

source: Logging in...
es: Iniciando sesión...
it: Accesso in corso...
ja: ログイン中...
zh: 登录中...

source: Log In
es: Iniciar Sesión
it: Accedi
ja: ログイン
zh: 登录

source: OR
es: O
it: O
ja: または
zh: 或

source: Loading...
es: Cargando...
it: Caricamento...
ja: 読み込み中...
zh: 加载中...

source: Continue with Google
es: Continuar con Google
it: Continua con Google
ja: Googleで続ける
zh: 使用Google继续

source: Continue with Apple
es: Continuar con Apple
it: Continua con Apple
ja: Appleで続ける
zh: 使用Apple继续

# dontHaveAccount
source: Don't have an account?
es: ¿No tienes cuenta?
it: Non hai un account?
ja: アカウントをお持ちでないですか？
zh: 没有账户？

# register
source: Sign Up
es: Regístrate
it: Registrati
ja: 登録する
zh: 注册

source: Create Account.
es: Crear Cuenta.
it: Crea Account.
ja: アカウント 作成
zh: 创建 账户

source: Name
es: Nombre
it: Nome
ja: 名前
zh: 姓名

source: Registering...
es: Registrando...
it: Registrazione in corso...
ja: 登録中...
zh: 注册中...

source: Sign Up
es: Registrarse
it: Registrati
ja: 登録する
zh: 注册

source: Transactions
es: Movimientos
it: Transazioni
ja: 取引履歴
zh: 交易

source: Filter by Date
es: Filtrar por Fecha
it: Filtra per Data
ja: 日付で絞り込み
zh: 按日期筛选

# ready
source: Done
es: Listo
it: Fatto
ja: 完了
zh: 完成

source: All
es: Todos
it: Tutti
ja: すべて
zh: 全部

# incomes
source: Income
es: Ingresos
it: Entrate
ja: 収入
zh: 收入

source: Expenses
es: Gastos
it: Uscite
ja: 支出
zh: 支出

source: Clear Date
es: Limpiar Fecha
it: Cancella Data
ja: 日付をクリア
zh: 清除日期

# noDataChart
source: No data to chart
es: No hay datos para graficar
it: Nessun dato da mostrare
ja: グラフデータがありません
zh: 无图表数据

# trend
source: Trend (7 days)
es: Tendencia (7 días)
it: Tendenza (7 giorni)
ja: トレンド (7日間)
zh: 趋势（7天）

source: Weekly Expenses
es: Gastos Semanales
it: Spese Settimanali
ja: 週間支出
zh: 每周支出

source: Weekly Income
es: Ingresos Semanales
it: Entrate Settimanali
ja: 週間収入
zh: 每周收入

source: By Category
es: Por Categoría
it: Per Categoria
ja: カテゴリー別
zh: 按类别

source: See Full
es: Ver completo
it: Vedi Tutto
ja: すべて見る
zh: 查看全部

source: No transactions
es: No hay movimientos
it: Nessuna transazione
ja: 取引はありません
zh: 无交易

# opens
source: Open:
es: Abre:
it: Apre:
ja: 開始:
zh: 开盘:

# closes
source: Close:
es: Cierra:
it: Chiude:
ja: 終了:
zh: 收盘:

source: No description
es: Sin descripción
it: Nessuna descrizione
ja: 説明なし
zh: 无描述

source: Edit Transaction
es: Editar Movimiento
it: Modifica Transazione
ja: 取引の編集
zh: 编辑交易

source: Description
es: Descripción
it: Descrizione
ja: 説明
zh: 描述

source: Amount
es: Monto
it: Importo
ja: 金額
zh: 金额

source: Date
es: Fecha
it: Data
ja: 日付
zh: 日期

source: Save
es: Guardar
it: Salva
ja: 保存
zh: 保存

# categoryLabel
source: Category
es: Categoría

# paymentMethod
source: Payment Details
es: Detalles del Pago

source: Delete
es: Eliminar
it: Elimina
ja: 削除
zh: 删除

# deleteTransactionConfirm
source: Are you sure you want to delete this transaction?
es: ¿Estás seguro de eliminar este movimiento?
it: Sei sicuro di voler eliminare questa transazione?
ja: この取引を削除してもよろしいですか？
zh: 您确定要删除此交易吗？

source: Transaction deleted
es: Movimiento eliminado
it: Transazione eliminata
ja: 取引が削除されました
zh: 交易已删除

# deleteError
source: Error deleting: {error}
es: Error al eliminar:
it: Errore eliminazione: {error}
ja: 削除エラー: {error}
zh: 删除错误: {error}

source: Today
es: Hoy
it: Oggi
ja: 今日
zh: 今天

source: Yesterday
es: Ayer
it: Ieri
ja: 昨日
zh: 昨天

source: Others
es: Otros
it: Altri
ja: その他
zh: 其他

source: Dashboard
es: Panel de Control
ja: ダッシュボード
zh: 仪表板

source: Balance Trend
es: Movimiento de Balance
it: Tendenza del Saldo
ja: 残高推移
zh: 余额趋势

source: Your Goals
es: Tus Metas
it: I Tuoi Obiettivi
ja: 目標
zh: 您的目标

source: Expenses by Category
es: Gastos por Categoría
it: Spese per Categoria
ja: カテゴリー別支出
zh: 按类别支出

source: Recent Transactions
es: Movimientos Recientes
it: Transazioni Recenti
ja: 最近の取引
zh: 最近交易

source: No recent activity
es: Sin actividad reciente
it: Nessuna attività recente
ja: 最近の活動はありません
zh: 无近期活动

# hello
source: Hello, {name}
es: Hola, {name}
it: Ciao, {name}
ja: こんにちは、{name}さん
zh: 你好，{name}

# helloSimple
source: Hello
es: Hola
it: Ciao
ja: こんにちは
zh: 你好

source: TOTAL BALANCE
es: SALDO TOTAL
it: SALDO TOTALE
ja: 総残高
zh: 总余额

source: New Goal
es: Nueva Meta
it: Nuovo Obiettivo
ja: 新しい目標
zh: 新目标

# goalNameHint
source: Goal Name (e.g. Trip)
es: Nombre de la meta (ej. Viaje)
it: Nome Obiettivo (es. Viaggio)
ja: 目標名 (例: 旅行)
zh: 目标名称（例如：旅行）

# targetAmountHint
source: Target Amount ($)
es: Monto objetivo ($)
it: Importo Target ($)
ja: 目標金額 ($)
zh: 目标金额（$）

source: No active goals
es: No tienes metas activas
it: Nessun obiettivo attivo
ja: アクティブな目標はありません
zh: 无活跃目标

source: Goal
es: Meta
it: Obiettivo
ja: 目標
zh: 目标

source: Deposit
es: Abonar
it: Deposita
ja: 入金
zh: 存入

source: Withdraw
es: Retirar
it: Preleva
ja: 出金
zh: 取出

source: Add
es: Añadir
it: Aggiungi
ja: 追加
zh: 添加

source: Withdraw from Goal
es: Retirar de Meta
it: Preleva dall'Obiettivo
ja: 目標から出金
zh: 从目标取出

source: Deposit to Goal
es: Abonar a Meta
it: Deposita nell'Obiettivo
ja: 目標に入金
zh: 存入目标

source: Available
es: Disponible
it: Disponibile
ja: 利用可能
zh: 可用

source: Saved
es: Ahorrado
it: Risparmiato
ja: 貯蓄額
zh: 已存

source: Remaining
es: Restante
it: Rimanente
ja: 残り
zh: 剩余

source: Amount to withdraw
es: Monto a retirar
it: Importo da prelevare
ja: 出金金額
zh: 提取金额

source: Amount to deposit
es: Monto a abonar
it: Importo da depositare
ja: 入金金額
zh: 存入金额

# allAmount
source: All
es: Todo
it: Tutto
ja: 全額
zh: 全部

# enterValidAmount
source: Enter a valid amount
es: Ingresa un monto válido
it: Inserisci un importo valido
ja: 有効な金額を入力してください
zh: 请输入有效金额

# cannotWithdrawMore
source: Cannot withdraw more than ${amount}
es: No puedes retirar más de ${amount}
it: Non puoi prelevare più di ${amount}
ja: ${amount}以上は出金できません
zh: 提取金额不能超过 ${amount}

# withdrewAmount
source: Withdrew ${amount} from "{goal}"
es: Retiraste ${amount} de "{goal}"
it: Prelevati ${amount} da "{goal}"
ja: "{goal}"から${amount}を出金しました
zh: 从 "{goal}" 提取了 ${amount}

# depositedAmount
source: Deposited ${amount} to "{goal}"!
es: ¡Abonaste ${amount} a "{goal}"!
it: Depositati ${amount} in "{goal}"!
ja: "{goal}"に${amount}を入金しました！
zh: 向 "{goal}" 存入了 ${amount}！

source: Delete Goal
es: Eliminar Meta
it: Elimina Obiettivo
ja: 目標を削除
zh: 删除目标

# deleteGoalConfirm
source: Are you sure you want to delete this goal?
es: ¿Estás seguro de eliminar esta meta?
it: Sei sicuro di voler eliminare questo obiettivo?
ja: この目標を削除してもよろしいですか？
zh: 您确定要删除此目标吗？

# goalAlreadySavedWarning
source: You already have ${amount} saved in this goal.
es: Ya tienes ${amount} ahorrados en esta meta.
it: Hai già risparmiato ${amount} in questo obiettivo.
ja: この目標にはすでに${amount}の貯蓄があります。
zh: 您已在此目标中存入 ${amount}。

# goalDeleted
source: Goal "{goal}" deleted
es: Meta "{goal}" eliminada
it: Obiettivo "{goal}" eliminato
ja: 目標"{goal}"を削除しました
zh: 目标 "{goal}" 已删除

source: Distribution
es: Distribución
it: Distribuzione
ja: 内訳
zh: 分布

source: No expenses registered
es: No hay gastos registrados
it: Nessuna spesa registrata
ja: 支出の記録はありません
zh: 无支出记录

# invitationTitle
source: Invitation!
es: ¡Invitación!
it: Invito!
ja: 招待！
zh: 邀请！

# invitationBody
source: {name} invited you to collaborate on: {goal}
es: {name} te ha invitado a colaborar en la meta: {goal}
it: {name} ti ha invitato a collaborare a: {goal}
ja: {name}さんが目標「{goal}」への協力を招待しています
zh: {name} 邀请您协作目标：{goal}

# invitationQuestion
source: Do you want to accept this invitation and share progress?
es: ¿Deseas aceptar esta invitación y compartir el progreso?
it: Vuoi accettare questo invito e condividere i progressi?
ja: この招待を受け入れて進捗を共有しますか？
zh: 您想接受此邀请并分享进度吗？

source: Reject
es: Rechazar
it: Rifiuta
ja: 拒否
zh: 拒绝

source: Accept
es: Aceptar
it: Accetta
ja: 承諾
zh: 接受

source: Invitation accepted
es: Invitación aceptada
it: Invito accettato
ja: 招待を承諾しました
zh: 邀请已接受

# unknownUser
source: Someone
es: Alguien
it: Qualcuno
ja: 誰か
zh: 某人

# defaultGoalName
source: a goal
es: una meta
it: un obiettivo
ja: 目標
zh: 一个目标

source: Add Saving
es: Añadir Ahorro
it: Aggiungi Risparmio
ja: 貯蓄を追加
zh: 添加储蓄

source: Withdraw Funds
es: Retirar Fondos
it: Preleva Fondi
ja: 資金を引き出す
zh: 提取资金

# savingAddedSuccess
source: Saving added successfully
es: Ahorro añadido exitosamente
it: Risparmio aggiunto con successo
ja: 貯蓄が正常に追加されました
zh: 储蓄添加成功

source: Insufficient funds
es: Fondos insuficientes
it: Fondi insufficienti
ja: 残高不足です
zh: 余额不足

# withdrawalSuccess
source: Withdrawal successful
es: Retiro realizado exitosamente
it: Prelievo effettuato con successo
ja: 引き出しが正常に完了しました
zh: 提取成功

source: Current balance
es: Saldo actual
it: Saldo attuale
ja: 現在の残高
zh: 当前余额

source: Progress
es: Progreso
it: Progresso
ja: 進捗
zh: 进度

source: Invite+
es: Invitar+
it: Invita+
ja: 招待+
zh: 邀请+

source: Progress chart coming soon!
es: ¡Gráfica de progreso próximamente!
it: Grafico di progressione disponibile a breve!
ja: 進捗グラフは近日公開予定です！
zh: 进度图表即将推出！

source: Contribution
es: Contribución
it: Contributo
ja: 寄付
zh: 贡献

source: Withdrawal
es: Retiro
it: Prelievo
ja: 引き出し
zh: 提取

source: Goal creation
es: Creación de meta
it: Creazione obiettivo
ja: 目標作成
zh: 目标创建

# inviteCollaboratorTitle
source: Invite Collaborator
es: Invitar Colaborador
it: Invita Collaboratore
ja: 共同作業者を招待
zh: 邀请协作伙伴

# inviteCollaboratorSubtitle
source: Share this goal with someone else
es: Comparte esta meta con alguien más
it: Condividi questo obiettivo con qualcun altro
ja: この目標を他の人と共有する
zh: 与他人分享此目标

# invitationUserCode
source: User Code
es: Código de Usuario
it: Codice Utente
ja: ユーザーコード
zh: 用户代码

# userCodeHint
source: e.g. JUAN-1234
es: ej. JUAN-1234
it: es. JUAN-1234
ja: 例: JUAN-1234
zh: 例如：JUAN-1234

# enterValidCode
source: Enter a valid code
es: Ingresa un código válido
it: Inserisci un codice valido
ja: 有効なコードを入力してください
zh: 请输入有效的代码

# invitationSentTo
source: Invitation sent to {code}
es: Invitación enviada a {code}
it: Invito inviato a {code}
ja: {code} に招待を送信しました
zh: 邀请已发送至 {code}

source: Error sending invitation
es: Error al enviar invitación
it: Errore nell'invio dell'invito
ja: 招待の送信中にエラーが発生しました
zh: 发送邀请时出错

source: Send Invitation
es: Enviar Invitación
it: Invia Invito
ja: 招待を送信
zh: 发送邀请

# errorGeneric
source: Error: {error}
es: Error:
it: Errore: {error}
ja: エラー: {error}
zh: 错误: {error}

# aiThinking
source: AI is thinking...
es: La IA está pensando...
it: L'IA sta pensando...
ja: AIが考えています...
zh: 人工智能正在思考...

# speechError
source: Voice error: {error}
es: Error de voz:
it: Errore vocale: {error}
ja: 音声エラー: {error}
zh: 语音错误: {error}

# voiceRecognitionUnavailable
source: Voice recognition not available
es: Reconocimiento de voz no disponible
it: Riconoscimento vocale non disponibile
ja: 音声認識は利用できません
zh: 语音识别不可用

source: Listening...
es: Escuchando...
it: Ascolto...
ja: 聞き取り中...
zh: 正在倾听...

source: Type here...
es: Escribe aquí...
it: Scrivi qui...
ja: ここに入力...
zh: 在此输入...

# assistantGreeting
source: Hi! I'm your financial assistant.
es: ¡Hola! Soy tu asistente financiero.
it: Ciao! Sono il tuo assistente finanziario.
ja: こんにちは！私はあなたの財務アシスタントです。
zh: 你好！我是你的财务助手。

# assistantDescription
source: I can help you record expenses, create goals, and analyze your finances with AI.
es: Puedo ayudarte a registrar gastos, crear metas y analizar tus finanzas con IA.
it: Posso aiutarti a registrare le spese, creare obiettivi e analizzare le tue finanze con l'IA.
ja: 支出の記録、目標の作成、AIによる財務分析のお手伝いをします。
zh: 我可以帮你记录支出、创建目标并使用 AI 分析你的财务状况。

source: QUESTION EXAMPLES
es: EJEMPLOS DE PREGUNTAS
it: ESEMPI DI DOMANDE
ja: 質問の例
zh: 问题示例

source: Fast Expense
es: Gasto Rápido
it: Spesa Rapida
ja: クイック支出
zh: 快速支出

# fastExpenseSubtitle
source: "Earned 3000 and spent 50"
es: "Gané 3000 y gasté 50"
it: "Guadagnato 3000 e speso 50"
ja: 「3000円稼いで50円使った」
zh: “赚了 3000，花了 50”

# newGoalSubtitle
source: "Save for trip"
es: "Ahorrar para viaje"
it: "Risparmiare per un viaggio"
ja: 「旅行のために貯金する」
zh: “为旅行攒钱”

# iaAnalysis
source: AI Analysis
es: Análisis IA
it: Analisi IA
ja: AI分析
zh: AI 分析

# iaAnalysisSubtitle
source: "6-month projection"
es: "Proyección 6 meses"
it: "Proiezione a 6 mesi"
ja: 「6ヶ月の予測」
zh: “6 个月预测”

# exportSubtitle
source: "Download CSV"
es: "Descargar CSV"
it: "Scarica CSV"
ja: 「CSVをダウンロード」
zh: “下载 CSV”

# finanzasAi
source: FINANCES AI
es: FINANZAS AI
it: FINANZA IA
ja: 財務AI
zh: 财务 AI

source: HISTORY
es: HISTORIAL
it: CRONOLOGIA
ja: 履歴
zh: 历史记录

source: New Chat
es: Nuevo Chat
it: Nuova Chat
ja: 新しいチャット
zh: 新聊天

source: No saved conversations.
es: No hay conversaciones guardadas.
it: Nessuna conversazione salvata.
ja: 保存された会話はありません。
zh: 没有保存的对话。

source: Untitled Conversation
es: Conversación sin título
it: Conversazione senza titolo
ja: 無題の会話
zh: 无标题对话

# transactionSavedSuccess
source: Transaction recorded correctly
es: Movimiento registrado correctamente
it: Movimento registrato correttamente
ja: 取引が正常に記録されました
zh: 交易记录成功

source: AI ASSISTANT
es: ASISTENTE IA
it: ASSISTENTE IA
ja: AIアシスタント
zh: AI 助手

# youLabel
source: YOU
es: TÚ
it: TU
ja: あなた
zh: 你

source: Premium Analysis
es: Análisis Premium
it: Analisi Premium
ja: プレミアム分析
zh: 高级分析

# exclusiveContent
source: Exclusive unlockable content.
es: Contenido exclusivo desbloqueable.
it: Contenuto esclusivo sbloccabile.
ja: 独占的なアンロック可能コンテンツ。
zh: 独家可解锁内容。

source: Deep AI Analysis
es: Análisis Profundo con IA
it: Analisi approfondita con IA
ja: AIによる詳細分析
zh: AI 深度分析

# aiGeneratedAnalysis
source: Analysis generated by Finance AI
es: Análisis generado por Finanzas AI
it: Analisi generata da Finanza IA
ja: 財務AIによる分析
zh: 由财务 AI 生成的分析

# strategicReportInfo
source: This report contains high-value strategic information.
es: Este reporte contiene información estratégica de alto valor.
it: Questo rapporto contiene informazioni strategiche di alto valore.
ja: このレポートには価値の高い戦略的情報が含まれています。
zh: 这份报告包含高价值的战略信息。

# unlockVideo
source: Watch Video to Unlock
es: Ver Video para Desbloquear
it: Guarda il Video per Sbloccare
ja: 動画を見てアンロック
zh: 观看视频解锁

source: Content unlocked!
es: ¡Contenido desbloqueado!
it: Contenuto sbloccato!
ja: コンテンツがアンロックされました！
zh: 内容已解锁！

# adLoadError
source: Could not load ad. Try again. ({error})
es: No se pudo cargar el anuncio. Intenta de nuevo. ({error})
it: Impossibile caricare l'annuncio. Riprova. ({error})
ja: 広告を読み込めませんでした。もう一度お試しください。({error})
zh: 无法加载广告。请重试。({error})

# csvReady
source: Excel/CSV Report Ready
es: Reporte Excel/CSV Listo
it: Report Excel/CSV pronto
ja: Excel/CSVレポートの準備完了
zh: Excel/CSV 报告已就绪

source: Report Locked
es: Reporte Bloqueado
it: Report bloccato
ja: レポートはロックされています
zh: 报告已锁定

# downloadAdPrompt
source: Watch an ad to download
es: Ve un anuncio para descargar
it: Guarda un annuncio per scaricare
ja: 動画を見てダウンロード
zh: 观看广告下载

# shareCsv
source: Share / Save CSV
es: Compartir / Guardar CSV
it: Condividi / Salva CSV
ja: CSVを共有 / 保存
zh: 分享 / 保存 CSV

# shareCsvText
source: Here is my financial report.
es: Aquí tienes mi reporte financiero.
it: Ecco il mio rapporto finanziario.
ja: 私の財務レポートです。
zh: 这是我的财务报告。

# csvShareError
source: Error sharing CSV: {error}
es: Error al compartir CSV:
it: Errore nella condivisione del CSV: {error}
ja: CSVの共有中にエラーが発生しました: {error}
zh: 分享 CSV 时出错: {error}

source: Transaction Summary
es: Resumen de Movimientos
it: Riepilogo Movimenti
ja: 取引概要
zh: 交易摘要

source: Concept
es: Concepto
it: Concetto
ja: 項目
zh: 项目

source: Result
es: Resultó
it: Risultato
ja: 結果
zh: 结果

source: Impact
es: Impacto
it: Impatto
ja: 影響
zh: 影响

source: Resulting Balance
es: Balance Resultante
it: Saldo Risultante
ja: 最終残高
zh: 最终余额

source: No recent data
es: Sin datos recientes
it: Nessun dato recente
ja: 最近のデータはありません
zh: 无近期数据

# multiTransactionTitle
source: {count} Transactions
es: {count} Transacciones
it: {count} Transazioni
ja: {count}件の取引
zh: {count} 笔交易

# saveAllTransactions
source: Save {count} Transactions
es: Guardar {count} Transacciones
it: Salva {count} Transazioni
ja: {count}件の取引を保存
zh: 保存 {count} 笔交易

source: All Saved
es: Todo Guardado
it: Tutto salvato
ja: すべて保存完了
zh: 已全部保存

# transactionsSavedCount
source: {count} transactions saved
es: {count} transacciones guardadas
it: {count} transazioni salvate
ja: {count}件の取引を保存しました
zh: 已保存 {count} 笔交易

source: Goal Suggestion
es: Sugerencia de Meta
it: Suggerimento Obiettivo
ja: 目標の提案
zh: 目标建议

# objective
source: Objective: {amount}
es: Objetivo: {amount}
it: Obiettivo: {amount}
ja: 目標: {amount}
zh: 目标: {amount}

source: Create Goal
es: Crear Meta
it: Crea Obiettivo
ja: 目標を作成
zh: 创建目标

source: Goal Created
es: Meta Creada
it: Obiettivo creato
ja: 目標を作成しました
zh: 目标已创建

source: Analysis Available
es: Análisis Disponible
it: Analisi disponibile
ja: 分析が利用可能です
zh: 分析可用

# viewChartsPrompt
source: Go to the 'Transactions' tab to see the charts.
es: Ve a la pestaña "Movimientos" para ver los gráficos.
it: Vai alla scheda 'Movimenti' per vedere i grafici.
ja: 「取引」タブでグラフを確認してください。
zh: 前往“交易”选项卡查看图表。

source: Ticket Generated
es: Ticket Generado
it: Ticket Generato
ja: チケットが生成されました
zh: 已生成票据

source: Confirm and Save
es: Confirmar y Guardar
it: Conferma e Salva
ja: 確認して保存
zh: 确认并保存

# balanceActual
source: CURRENT BALANCE
es: SALDO ACTUAL
it: SALDO ATTUALE
ja: 現在の残高
zh: 当前余额

# saveError
source: Error saving: {error}
es: Error al guardar:
it: Errore durante il salvataggio: {error}
zh: 保存出错: {error}

source: Transaction
es: Transacción
it: Movimento
zh: 交易

# exportCSV
source: Export
es: Exportar
it: Esporta
zh: 导出

# amountLabel
source: Amount
es: Monto
it: Importo
zh: 金额

# fastExpenseSuggestion
source: Today I earned 3000 and spent 50 on coffee
es: Hoy gané 3000 y gasté 50 en café
it: Oggi ho guadagnato 3000 e speso 50 per il caffè
zh: 今天我赚了3000，花了50买咖啡

# newGoalSuggestion
source: I want to save for a trip
es: Quiero ahorrar para un viaje
it: Voglio risparmiare per un viaggio
zh: 我想为旅行攒钱

# aiAnalysisSuggestion
source: Give me a strategic analysis of my finances for the next 6 months
es: Hazme un análisis estratégico de mis finanzas para los próximos 6 meses
it: Fammi un'analisi strategica delle mie finanze per i prossimi 6 mesi
zh: 请对我未来6个月的财务状况进行战略分析

# exportCsvSuggestion
source: Export my transactions to CSV
es: Exportar mis movimientos a CSV
it: Esporta i miei movimenti in CSV
zh: 将我的交易导出为 CSV

# transactionAi
source: AI Transaction
es: Transacción AI
it: Movimento IA
zh: AI 交易

# goalAiDescription
source: Goal created by AI
es: Meta creada por AI
it: Obiettivo creato dall'IA
zh: 由 AI 创建的目标

source: Share Link and Code
es: Compartir Enlace y Código
it: Condividi link e codice
zh: 分享链接和代码

# onboardingWelcome
source: Welcome to Finance AI
es: Bienvenido a Finanzas AI
it: Benvenuto in Finanze IA
zh: 欢迎使用金融AI

# onboardingSubtitle
source: Let's set up your financial profile in a few simple steps.
es: Vamos a configurar tu perfil financiero en unos simples pasos.
it: Configuriamo il tuo profilo finanziario in pochi semplici passaggi.
zh: 让我们通过几个简单的步骤设置您的财务概况。

# stepBudgetTitle
source: 3. Your Budget
es: 3. Tu Presupuesto
it: 3. Il tuo budget
zh: 3. 您的预算

# stepBudgetSubtitle
source: How much do you plan to spend monthly in total?
es: ¿Cuánto planeas gastar mensualmente en total?
it: Quanto pensi di spendere mensilmente in totale?
zh: 您计划每月总共支出多少？

# stepBudgetHint
source: e.g. {amount}
es: Ej. {amount}
it: es. {amount}
zh: 例如：{amount}

source: Monthly Available Money
es: Dinero disponible mensual
it: Soldi mensili disponibili
zh: 每月可用资金

# incomeMinusDebts
source: Your income minus your debts.
es: Tus ingresos menos tus deudas.
it: Il tuo reddito meno i tuoi debiti.
zh: 您的收入减去您的债务。
